9/data/attachments/b5ffcd1d835d13b1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_60a94ffb-b0d2-4575-90f7-06309ce18dc4</nif:username>
            <nif:friendToBeAdded>Michelle_nature_Friend_19026_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>